app/views/settings/unit.html.erb

SELECT COUNT(*) FROM `users` WHERE `users`.`unit_id` = 1
---
				<td><%= unit.leader %></td>
				<td><%= unit.users.size %></td>