app/controllers/authentication_controller.rb

	def sign_out
		user = User.find_by_id(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

	def register
		@user = User.new(params[:user])

		if @user.valid?
			update_authentication_token(@user, params[:user][:remember_me])
			@user.save
---
INSERT INTO `users` (`authentication_token`, `birthday`, `created_at`, `hashed_password`, `name`, `password_expires_after`, `password_reset_token`, `position_id`, `role_id`, `salt`, `unit_id`, `updated_at`, `username`) VALUES (NULL, NULL, '2014-04-28 05:12:50', '$2a$10$Q9krSr3OMPxUw.CBpqtEl.06aX/uUN9f4PGKa/eExSSDt6ofKLz9y', 'XiangJun Wang', NULL, NULL, NULL, NULL, '$2a$10$Q9krSr3OMPxUw.CBpqtEl.', NULL, '2014-04-28 05:12:50', 'xiangjunwang')

	def set_account_info
		old_user = current_user

		# verify the current password by creating a new user record.
		@user = User.authenticate_by_username(old_user.username, params[:user][:password])

		# verify
		if @user.nil?
			@user = current_user
			@user.errors[:password] = "Password is incorrect."
			render :action => "account_settings"
		else
			# update the user with any new username and name
			@user.update_attributes(params[:user])
			# Set the old email and username, which is validated only if it has changed.
			@user.previous_username = old_user.username

			if @user.valid?
			# If there is a new_password value, then we need to update the password.
				@user.password = @user.new_password unless @user.new_password.nil? || @user.new_password.empty?
---
SELECT 1 FROM `users` WHERE (`users`.`username` = BINARY 'xiangjunwang' AND `users`.`id` != 1) LIMIT 1