app/controllers/settings_controller.rb

	def unit
		@setting_nav_id = 'unit'
		@units = Unit.all
---
SELECT `units`.* FROM `units`

	def register_unit
		@setting_nav_id = 'unit'
		unit = Unit.new(params[:unit])
		if unit.valid?
			unit.save
---
INSERT INTO `units` (`created_at`, `leader`, `name`, `updated_at`) VALUES ('2014-04-28 16:32:22', 'Boss', 'Boss', '2014-04-28 16:32:22')

	def edit_unit
		@setting_nav_id = 'unit'
		@unit = Unit.find_by_id(params[:id])
---
SELECT `units`.* FROM `units` WHERE `units`.`id` = 1 LIMIT 1

	def delete_unit
		@setting_nav_id = 'unit'
		@unit = Unit.find_by_id(params[:id])
---
SELECT `units`.* FROM `units` WHERE `units`.`id` = 2 LIMIT 1