app/controllers/users_controller.rb

	def list
		# User to set menu item active
		@nav_id = 'nav-users'
		@users = User.all
---
SELECT `users`.* FROM `users`